(function(){

  var adhkar = [
    {dhekir:`اللهم صلً وسلم وبارك على سيدنا ونبينا محمد وعلى اله وصحبه أجمعين`},
    {dhekir:`سبحان الله وبحمده، سبحان الله العظيم`},
    {dhekir:`لا إله إلا أنت سبحانك إني كنت من الظالمين`},
    {dhekir:`اللهم أنت ربي، لا إله إلا أنت، خلَقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شرِّ ما صنعت، أبُوء لك بنعمتك عليّ وأبوء بذنبي، فاغفر لي؛ فإنه لا يغفر الذنوب إلا أنت`},
    {dhekir:`اللهم إني أسألك العافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي، وأهلي ومالي، اللهم استُر عوراتي، وآمِن رَوعاتي، اللهم احفظني من بين يدي ومن خلفي، وعن يميني وعن شمالي، ومن فوقي، وأعوذ بعظمتك أن أُغتال من تحتي`},
    {dhekir:`لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير`},
    {dhekir:`اللهم فاطر السموات والأرض، عالم الغيب والشهادة، ربَّ كلِّ شيء ومليكه، أشهد أنْ لا إله إلا أنت، أعوذ بك من شرِّ نفسي، وشر الشيطان وشِرْكه، وأن أَقترف على نفسي سوءًا، أو أجرَّه إلى مسلم`},
    {dhekir:`رضيت بالله ربًّا، وبالإسلام دينًا، وبمحمد -صلى الله عليه وسلم- نبيًّا`},
    {dhekir:`يا حي يا قيُّوم، برحمتك أستغيث، أصلِح لي شأني كله، ولا تَكلني إلى نفسي طرْفة عينٍ`},
    {dhekir:`سبحان الله وبحمده عدد خلقه، ورضا نفسه، وزِنة عرشه، ومداد كلماته`},
    {dhekir:`بسم الله الذي لا يضرُّ مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم`},
    {dhekir:`اللهم إني أصبحت (أمسيتُ) أُشهدك وأُشهد حمَلة عرشك وملائكتك، وجميع خلْقك أنَّك أنت الله، لا إله إلا أنت وأن محمدًا عبدك ورسولك`},
    {dhekir:`اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملاً متقبَّلاً`},
    {dhekir:`سبحان الله وبحمده`},
    {dhekir:`أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم وأتوب إليه`},
    {dhekir:`حسبي الله لا إله إلّا هو عليه توكلت وهو رب العرش العظيم`},
  ]

  function showdhekir(){
    var resultRandom = adhkar[parseInt(Math.random() * adhkar.length)]
    document.getElementById(`dhekir`).innerHTML = resultRandom.dhekir
  }

  document.getElementById(`new`).onclick=function(){showdhekir()};

})();








